{
  "backend/main.mo": "Defines policy, lead, notification, and user profile types with maps for storage and includes access control plus various query and update methods for profiles, policies, and leads.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Collection of summarized descriptions for all frontend files including components, hooks, pages, utilities, and constants.",
  "frontend/docs/app-flow.md": "Documentation describing the full user journey, screen flows, navigation, and bilingual support for the app.",
  "frontend/docs/monetization.md": "Outlines the app’s monetization strategy, revenue model, costs, KPIs, growth plan, and compliance requirements.",
  "frontend/docs/scaling-roadmap.md": "Roadmap detailing planned feature phases, technical scaling considerations, resource needs, and timelines.",
  "frontend/index.css": "Tailwind CSS base file defining design tokens, themes, and color variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/scripts/verify-actor-usage.ts": "Node script that scans source files for deprecated actor patterns and reports validation errors.",
  "frontend/src/App.tsx": "Main app entry configuring routes, theme, language provider, router, and global UI elements.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity and react-query, handling authentication state and errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter basic profile data and submit it via a save mutation.",
  "frontend/src/components/category/IconTile.tsx": "Clickable card displaying an icon and label for a category.",
  "frontend/src/components/layout/AppHeader.tsx": "Top header showing app branding, notifications badge, and login button.",
  "frontend/src/components/navigation/BottomTabNav.tsx": "Bottom navigation bar rendering tab links with icons and active-state styling.",
  "frontend/src/components/settings/LanguageToggle.tsx": "UI control allowing users to switch between English and Hindi.",
  "frontend/src/components/support/CallbackRequestForm.tsx": "Form for users to request a callback with validation, submission handling, and success feedback.",
  "frontend/src/constants/categories.ts": "Defines insurance category metadata and a helper to look up category info by ID.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAppActor.ts": "Builds a backend actor using HttpAgent and dynamic IDL, keyed by the user's principal for authenticated calls.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the logged‑in user's profile using the current actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout, and identity loading through a React context.",
  "frontend/src/hooks/useNotifications.ts": "Loads notifications from the backend actor when available.",
  "frontend/src/hooks/usePolicies.ts": "Fetches policies by category, single policy, or comparisons using the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Defines mutations for saving profiles, submitting leads, requesting callbacks, and querying rewards.",
  "frontend/src/i18n/LanguageProvider.tsx": "Manages app language state, persistence, and translation lookup.",
  "frontend/src/i18n/translations.ts": "Contains English and Hindi translation strings for UI text.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/layouts/TabShell.tsx": "Layout with header, main content outlet, and bottom tab navigation.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/CategoriesPage.tsx": "Renders a grid of category tiles and navigates to a selected category's policy list.",
  "frontend/src/pages/CategoryPoliciesPage.tsx": "Displays policies for a selected category with options to view details or add/remove from comparison.",
  "frontend/src/pages/CompareDetailPage.tsx": "Shows a detailed side‑by‑side comparison of selected policies with apply links.",
  "frontend/src/pages/ComparePage.tsx": "Manages the list of selected policies and provides actions to compare or clear them.",
  "frontend/src/pages/DisclaimerPage.tsx": "Presents multiple disclaimer sections with translated text and a link back to home.",
  "frontend/src/pages/HomePage.tsx": "Provides quick‑action navigation tiles, a compliance alert, and a link to the disclaimer.",
  "frontend/src/pages/LeadFormPage.tsx": "Displays a lead capture form for a selected policy with validation and submission handling.",
  "frontend/src/pages/MyLeadsPage.tsx": "Shows a placeholder page for viewing the user's submitted applications.",
  "frontend/src/pages/MySupportRequestsPage.tsx": "Shows a placeholder page listing the user's support request history.",
  "frontend/src/pages/NotificationsPage.tsx": "Fetches and displays in‑app notifications grouped with category labels.",
  "frontend/src/pages/PolicyDetailPage.tsx": "Displays detailed policy information fetched by ID and provides actions to apply or view disclaimers.",
  "frontend/src/pages/RewardsPage.tsx": "Shows user reward balance, referral code handling, and reward-related actions with input and copy functionality.",
  "frontend/src/pages/SupportPage.tsx": "Provides support resources including FAQs, language toggle, callback form, and a contact form with submission handling.",
  "frontend/src/state/compareSelection.ts": "Manages selected policy IDs for comparison with localStorage persistence and utility functions to modify selections.",
  "frontend/src/state/notificationReadState.ts": "Tracks read notification IDs using localStorage with helpers to mark and query read status.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters including hash routing support.",
  "frontend/src/utils/validation.ts": "Validates mobile numbers using a simple regex pattern.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Defines the project’s current state for an Android insurance-facilitator app, including architecture notes, regulatory/UX requirements, known build issues, and a list of implemented features. Serves as a configuration and planning snapshot for ongoing fixes and development."
}